#### DrawLayer Enumeration

---

|  |
| --- |
| See Also |

An enumerated type containing possible DrawLayer options.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
  **Since:**  2020
  **Since:**  2020

# Syntax

| C# |
| --- |
| ``` public enum DrawLayer ``` |

| Visual Basic |
| --- |
| ``` Public Enumeration DrawLayer ``` |

| Visual C++ |
| --- |
| ``` public enum class DrawLayer ``` |

# Members

| Member name | Description |
| --- | --- |
| Foreground | Draw in the foreground layer |
| Background | Draw in the background layer |

# See Also

Autodesk.Revit.DB Namespace